dataset_gen/NS_datasets_16/LDC/LDC_Multiple_Hole/Design_Point_0/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type            noSlip;
    }
    right
    {
        type            noSlip;
    }
    bottom
    {
        type            noSlip;
    }
    top
    {
        type            fixedValue;
        value           uniform (0.00378 0 0);  // Example Umax value (must be set dynamically!)

    }
    hole
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}
